InformationRegisters/НастройкиЗаконодательныхИзменений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>НастройкиЗаконодательныхИзменений</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗначениеПараметра</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ПараметрНастройки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПараметрыЗаконодательныхИзменений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ПараметрыЗаконодательныхИзменений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>ПараметрыЗаконодательныхИзменений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ДатаНачалаИспользованияФормыНН13</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДатаНачалаИспользованияФормыНН15</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДатаНачалаИспользованияФормыТТН2024</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

InformationRegisters/НастройкиЗаконодательныхИзменений/Ext/ManagerModule.bsl
Функция ЗначениеНастройки(ПараметрНастройки, Период = Неопределено) Экспорт
	
	Результат =  РегистрыСведений.НастройкиЗаконодательныхИзменений.ПолучитьПоследнее(Период, 
		Новый Структура("ПараметрНастройки", Перечисления.ПараметрыЗаконодательныхИзменений[ПараметрНастройки])).ЗначениеПараметра;
		
	Если Результат = Неопределено Тогда
		
		Если ПараметрНастройки = "ДатаНачалаИспользованияФормыНН15" Тогда
			Результат = '20230801';
		КонецЕсли;

		Если ПараметрНастройки = "ДатаНачалаИспользованияФормыТТН2024" Тогда
			Результат = '20250103';
		КонецЕсли;                 
		
	КонецЕсли;
		
	Возврат Результат;
	
КонецФункции
